import React from "react";
import { NavLink } from "react-router-dom";

import "./index.css";

const Navbar = () => {
  return (
    <header className="wrapper">
      <div className="navbar">
        <h2 className="navbar__logo">
          <NavLink to="/main">
            <svg
              width="69"
              height="64"
              viewBox="0 0 69 64"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M4 59.1819V4.81824H25.6591C27.3189 4.81824 30.37 4.81843 30.37 4.81843L64.289 4.81824V15.9461H40.0759V26.4234H62.4736V37.5512H40.0759V48.054H64.3913V59.1819H30.37L23.553 40.6194H17.071V59.1819H4ZM16.071 39.6194H24.1524L31.37 58.1819H63.3913V49.054H39.0759V36.5512H61.4736V27.4234H39.0759V14.9461H63.289V5.81824H31.37C31.37 5.81824 27.3333 5.81824 25.6591 5.81824H5V58.1819H16.071V39.6194ZM31.37 17.6557C31.0273 17.2399 30.7445 16.9893 30.37 16.705C29.9168 16.3608 29.4033 16.0643 28.8295 15.8154C27.4318 15.1847 25.6676 14.8694 23.5369 14.8694H16.071V30.7216H23.5881C25.7017 30.7216 27.4574 30.4319 28.8551 29.8523C29.4182 29.6189 29.9231 29.3384 30.37 29.0109C30.744 28.7368 31.0774 28.4297 31.37 28.0897C31.6626 27.7497 32.6704 25.0467 32.6923 22.9891C32.7151 20.8434 32.6881 19.2554 31.37 17.6557ZM30.37 18.0379C29.7557 17.363 29.2231 17.0761 28.4316 16.7328L28.4249 16.7299L28.4183 16.7269C27.1898 16.1726 25.5775 15.8694 23.5369 15.8694H17.071V29.7216H23.5881C25.6188 29.7216 27.2337 29.442 28.4721 28.9286C29.2448 28.6082 29.8721 28.1969 30.37 27.6983C30.8679 27.1997 31.5466 24.8867 31.5688 22.9891C31.5921 20.9998 31.6978 19.4967 30.37 18.0379Z"
                fill="black"
              />
            </svg>
          </NavLink>
        </h2>
        <div className="navbar__menu">
          <NavLink to="/main" className="navbar__item">
            Главная
          </NavLink>
          <NavLink to="/search" className="navbar__item">
            Поиск
          </NavLink>
          <NavLink to="/property_builders" className="navbar__item">
            Застройщики
          </NavLink>
          <NavLink to="/contacts" className="navbar__item">
            Связь с нами
          </NavLink>

          <NavLink to="/favorite" className="navbar__item">
            <svg
              width="24"
              height="24"
              viewBox="0 0 24 24"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M12.8681 4.24127C15.449 1.5049 19.7035 1.81453 21.9067 4.92903C23.8849 7.72559 23.4001 11.6831 20.8465 13.8491L12 21.3526L3.1535 13.8491C3.1535 13.8491 3.15349 13.8491 3.15349 13.8491C0.599889 11.6831 0.115117 7.7256 2.09335 4.92904C4.2965 1.81456 8.55098 1.50489 11.1319 4.24126L11.3634 4.48681C11.5288 4.6621 11.7591 4.76146 12 4.76146C12.241 4.76146 12.4712 4.6621 12.6366 4.48681L12.8681 4.24127Z"
                stroke="black"
                stroke-width="1.75"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
            </svg>
          </NavLink>
          <NavLink to="/notifications" className="navbar__item">
            <svg
              width="24"
              height="26"
              viewBox="0 0 24 26"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M8.90418 23.5307C9.7293 24.2589 10.813 24.7007 11.9999 24.7007C13.187 24.7007 14.2707 24.2589 15.0959 23.5307M19.0204 8.31966C19.0204 6.45772 18.2808 4.67204 16.9642 3.35544C15.6477 2.03885 13.8619 1.29919 11.9999 1.29919C10.138 1.29919 8.35238 2.03885 7.03579 3.35544C5.7192 4.67204 4.97954 6.45772 4.97954 8.31966C4.97954 11.9354 4.06743 14.4111 3.04852 16.0485C2.18906 17.4298 1.75933 18.1203 1.77508 18.3131C1.79253 18.5264 1.83772 18.6077 2.00963 18.7352C2.16488 18.8504 2.86473 18.8504 4.26445 18.8504H19.7356C21.1353 18.8504 21.8352 18.8504 21.9904 18.7352C22.1623 18.6077 22.2075 18.5264 22.2249 18.3131C22.2407 18.1203 21.8109 17.4298 20.9515 16.0485C19.9326 14.4111 19.0204 11.9354 19.0204 8.31966Z"
                stroke="black"
                stroke-width="1.6"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
            </svg>
          </NavLink>
          <NavLink to="/me" className="navbar__user">
            <img src="../../icons/avatar_user.svg" alt="avatar" />
            <div>ID пользователя</div>
          </NavLink>
        </div>
      </div>
    </header>
  );
};

export default Navbar;
